# 15.	Написать программу, получающую набор произведений чисел от 1 до N. Пример: пусть N = 4, 
# тогда [ 1, 2, 6, 24 ]


n =  int(input('Введите вещественное n: '))

list = []
rez = 1
for i in range(1, n+1):
    rez *=i
    list.append(rez)
print(f'Набор произведений чисел от 1 до {n}: ', list)
